src/cf/DataProcessors/мрРасчетСреднегоЧекаПоПродавцам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<DataProcessor>
		<Properties>
			<Name>мрРасчетСреднегоЧекаПоПродавцам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоБлоковШагаМАП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоБлоковШагаШафл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/DataProcessors/мрРасчетСреднегоЧекаПоПродавцам/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗапуститьЗадание(Команда)
	ЗапуститьЗаданиеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗапуститьЗаданиеНаСервере()
	
	Менеджер = РеквизитФормыВЗначение("Объект");
	
	ПараметрыЗадания = Новый Структура("");
	ПараметрыЗадания.Вставить("ДатаНачала");
	ПараметрыЗадания.Вставить("ДатаОкончания");
	ПараметрыЗадания.Вставить("КоличествоБлоковШагаМАП");
	ПараметрыЗадания.Вставить("КоличествоБлоковШагаШафл");

	ЗаполнитьЗначенияСвойств(ПараметрыЗадания, Менеджер);
	
	ПараметрыОбработки = Новый Структура();
	ПараметрыОбработки.Вставить("Менеджер", "мрРасчетСреднегоЧекаПоПродавцам");
	ПараметрыОбработки.Вставить("Параметры", ПараметрыЗадания);
	
	//MapReduce.ЗапуститьПроцессMapReduce(ПараметрыОбработки);
	MapReduce.МастерПроцесс(ПараметрыОбработки);
	                                   
КонецПроцедуры
